#include <stdio.h>

/*
15
1) 1 2 (2개로 가능한가)
(15-(1+2))/2 = 6
6+1, 6+2

2) 1 2 3 (3개로 가능한가)
(15-(1+2+3))/3 = 3
1+3, 1+4, 1+5

3) 1 2 3 4
(15-(1+2+3+4))/4 = X

4)

*/


int main(){
    int a, b=1, cnt=0, i;

    scanf("%d", &a);

    int tmp = a;

    a= a-1;

    while(a>0){
        b++; // 개수
        a=a-b;    // n, n-(1), n-(1+2), n-(1+2+3),...

        if(a%b == 0){   //  만약 나머지가 0이라면
            for(i=1;i<b; i++){
                printf("%d + ", (a/b)+i); // 그 몫에 각 i를 더하여 출력
            }
            printf("%d = %d\n", (a/b)+i, tmp); // 마지막 출력
            cnt++; // 해의 개수
        }
    }
    printf("%d", cnt);

    return 0;


}